# 檢查身分證號碼是否正確-chkID

# 依據中華民國國民身分證統一編號邏輯進行字串校驗：
# 程式邏輯如下：  
# (1)	檢查是否有十個字元，超過十個字元不准輸入  
# (2)	檢查第一個字元是否為英文字母，若為小寫將其轉換成大寫  
# (3)	檢查第二個字元是否為1或2數字  
# (4)	檢查第三個至第十個字元是否為數字  
# (5)	檢查最後一個檢查碼是否正確  

# 檢查碼的規則請查網路：
# 1. 字母轉換：開頭的英文字母會根據對應表轉換為兩位數字。  
# 2. 賦予權重：將轉換後的數字與後續的數字展開，每一位數都有固定的「權重」。  
# 計算方式如下：字母轉換後的十位數*1+ 字母轉換後的個位數*9  
# 接下來的數字依序 * 8, 7, 6, 5, 4, 3, 2, 1  (第n碼乘上(10-n))  
# 3. 上述加總 後 加最後一碼 (檢查碼) 得到S
# 4. S為10的倍數 (若不是代表是錯誤的身分證)

def chkID(n):
    n = n.upper()
    id = list(n)
    number = ['1','2','3','4','5','6','7','8','9','0']
    Eng = ['A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z']
    id_list = [10, 11, 12, 13, 14, 15, 16, 17, 34, 18, 19, 20, 21, 22, 35, 23, 24, 25, 26, 27, 28, 29, 32, 30, 31, 33]
    print (id)
    if len(id) != 10 :
        return "不准輸入"
    if id[0] not in Eng :
        return "不正確"
    if id[1] != '1' and id[1] !='2' :
        return "不正確"
    for i in range(1,len(id)):
        if id[i] not in number:
            return "不正確"
    index = ord(id[0]) - 65
    x = id_list[index]//10 + (id_list[index]%10)*9
    S = x +sum(int(id[i])*(9-i) for i in range(1,9))
    print(S)    
    if int(id[9])!=(10 - S % 10) % 10:
        return "不正確"     
    else:
        return "正確"

n = input()
print(chkID(n))