# 4.	選擇性敘述的練習-refund
# 輸入在某商店購物應付金額與實付金額。
# 實付金額小於應付金額，則印出”金額不足”。
# 實付金額等於應付金額，則印出”不必找錢”。
# 實付金額大於應付金額，則輸出找回金額最少的鈔票數和錢幣數。
# 假設幣值只有1000, 500, 100元紙鈔和50, 10, 5, 1元硬幣。
# 說明：若買了132元的商品，付1000元，應找回一張500元，三張100元，一個50元硬幣，一個10元硬幣，一個5元硬幣和三個1元硬幣。



def money(n,m):
    if m < n:
        return "金額不足"
    elif m == n:
        return "不必找錢"
    else:
        i = m - n
        a = i // 1000
        i = i % 1000
        b = i // 500
        i = i % 500
        c = i // 100
        i = i % 100
        d = i // 50
        i = i % 50
        e = i // 10
        i = i % 10
        f = i // 5
        i = i % 5
        g = i
        return (f"{a}張1000元 {b}張500元 {c}張100元 {d}個50元硬幣 {e}個10元硬幣 {f}個5元硬幣 {g}個1元硬幣")

n = int(input("應付金額: "))
m = int(input("實付金額: "))
print(money(n,m))